/**
 * Two Digit Timer (with various unicode labels)
 * 2016-09-29 Jeremy Douglass riff on a sketch by MOULOUD2016
 * https:// forum.processing.org/two/discussion/18349/how-to-create-a-two-digits-timer-that-counts-from-00-to-99-without-stoping#latest
 */


//// line not needed -- raw unicode brainstorming for below
String misc = "ϡЂЊЖФЯѢ€ҙҰӔ  ᵃᵇᵈᵉᵍᵏᵐᵒᵖᵗᵘᵛᶜᶠᶻ  ḆḇḌḍḎḏ1E10ḐḑḖḗḠḡḤḥḦḧḨḩḪḫḲḳḴḵḶḷḸḹḺḻḾḿṀṁṂṃṄṅṆṇṈṉṒṓṘṙṚṛṜṝṞṟṠṡṢṣṬṭṮṯṾṿẀẁẂẃẄẅẎẏẐẑẒẓẔẕẖẗẞẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặẸẹẺẻẼẽẾếỀềỂểỄễỆệỈỉỊịỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợỤụỦủỨứỪừỬửỮữỰựỲỳỴỵỶỷỸỹ  άέήίόύώΆ᾽ι᾿῀῁ΈΉ῍῎῏ΐΊ῝῞῟ΰΎ῭΅`ΌΏ  ‐‒–—―‖‗‘’‚‛“”„†‡•  …‰‹›‼‽‾‿⁄⁇⁈⁉⁰ⁱ⁴⁵⁶⁷⁸⁹⁽⁾ⁿ₀₁₂₃₄₅₆₇₈₉ₔ₡₣₤₦₧₩₫€₮20B0₱₲₴₵₸₹₺₽℅ℓ№℗℠™ΩKÅ℮⅐⅑⅒⅓⅔⅕⅖⅗⅘⅙⅚⅛⅜⅝⅞  ∀∂∃∆∏∑∙√∞∟∩∫∷≠≡≤≥⌂⌐⌜⌝⌞⌟2320⌠⌡  ─━│┃┄┅┆┇┈┉┊┋┌┍┎┏2510┐┑┒┓└┕┖┗┘┙┚┛├┝┞┟2520┠┡┢┣┤┥┦┧┨┩┪┫┬┭┮┯2530┰┱┲┳┴┵┶┷┸┹┺┻┼┽┾┿2540╀╁╂╃╄╅╆╇╈╉╊╋╌╍╎╏2550═║╒╓╔╕╖╗╘╙╚╛╜╝╞╟2560╠╡╢╣╤╥╦╧╨╩╪╫╬╭╮╯2570╰╱╲╳╴╵╶╷╸╹╺╻╼╽╾╿  2580▀▁▂▃▄▅▆▇█▉▊▋▌▍▎▏2590▐░▒▓▔▕▖▗▘▙▚▛▜▝▞▟■□▪▫▬▲△▴▵▶▷▸▹►▻▼▽▾▿25C0◀◁◂◃◄◅◆◇◈◉◊○◌◍◎●25D0◐◑◒◓◔◕◖◗◘◙  ☑ ☕☼✓❤⟦⟧";


char [] num;
char [] num1 ={'0','1','2','3','4','5','6','7','8','9'};
char [] num2 ={'0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F'};
char [] num3 ={'•','↗','→','↘','↓','↙','←','↖','↑','⇑'}; // ⇐⇑⇒⇓↕↔
char [] num4 ={'☺', '☻', '♪', '♫', '♀', '♂', '♠', '♣', '♥', '♦'};
char [] num5 ={' ', '▁', '▂', '▃', '▄', '▅', '▆', '▇', '█', '▒'};
int i,j = 0;

void setup(){
  size(200,150);
  num = num3;
}
 
void draw(){
  delay(250);  // you can increase the speed of the timer
  i+=1;
  background(255);
  strokeWeight(10);
  textSize(50);
  fill(0,255,0); 
  if(i>num.length-1){
    i=0;
    j+=1;
  }
  if(j>num.length-1){
    i=0;
    j=0;
  }
  text(num[i],100,100);
  text(num[j],50,100);
}